app/controllers/vacationplanner_controller.rb

SELECT "employees".* FROM "employees"
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? ORDER BY "employees"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."employee_id" = ?  [["employee_id", 1]]
---
  def index
    @employees ||= Employee.all
    @supervisors ||= Employee.all.where(supervisor_id: nil)
    @subordinates ||= Employee.all.where.not(supervisor_id: nil)
    @current_user = current_employee

    @my_requests = Request.all.where(employee_id: @current_user.id)